{
  "data": [
    {
      "id": 1,
      "title": "Portfolio Website",
      "description": "My personal website serves as a digital portfolio, showcasing my projects, skills, and experiences. This project is a testament to my passion for web development and design.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/portfolio-website.webp",
      "githubUrl": "https://github.com/javecilla/Personal-Web-Portfolio",
      "demoUrl": "https://javecilla.vercel.app/",
      "technologies": [
        {
          "name": "Vue.js",
          "icon": "vueIcon"
        },
        {
          "name": "TypeScript",
          "icon": "tsIcon"
        },
        {
          "name": "Tailwind CSS",
          "icon": "tailwindIcon"
        },
        {
          "name": "Firebase",
          "icon": "firebaseIcon"
        }
      ],
      "category": "Personal",
      "isHighlight": false,
      "isRecent": false,
      "isAvailable": true,
      "link": "/project/portfolio-website"
    },
    {
      "id": 3,
      "title": "Online Voting System",
      "description": "I created a dynamic Online Voting System for Golden Minds Colleges to replace inefficient manual voting processes. Launched in 2023, this solo project delivers a seamless, secure, and engaging digital voting experience, enhancing community participation across multiple events.\n\nProblem & Solution\nManual voting at Golden Minds Colleges was slow, error-prone, and inaccessible to remote participants. My solution digitized the process, integrating real-time updates, secure payments via GCash, and Recaptcha verification. This increased voter turnout by 40% in its first year while ensuring accuracy and accessibility.\n\nKey Features\n- Live Previews: Real-time voting results.\n- Accurate Calculations: Reliable vote tabulation with optimized database queries.\n- GCash Integration: Secure, seamless payment handling.\n- Security: Email verification and Recaptcha to prevent fraud.\n- Dashboard: Comprehensive analytics with charts for tracking engagement.\n\nProject Timeline\n- 2023 - Santa Maria Teen Model: Debuted the system, setting a new standard for digital voting.\n- 2023 - Buwan ng Wika: Enhanced platform for cultural engagement.\n- 2024 - Mister, Miss, and Pride: Promoted inclusivity with innovative solutions.\n- 2024 - Buwan ng Wika: Celebrated linguistic heritage with high participation.\n\nTechnical Challenges & Solutions\n- Real-Time Updates: Used Laravel’s event broadcasting to manage live previews efficiently, avoiding server overload.\n- Payment Security: Integrated GCash (QR Code)via Laravel’s HTTP client for reliable processing.\n\nImpact\n- Processed 5,000+ votes across four events with zero downtime.\n- Boosted voter participation by 40% due to improved accessibility.\n- Adopted as the college’s standard voting platform after positive administrative feedback.\n\nArchitecture\n- Backend: Laravel for API endpoints, logic, and integrations (GCash, Recaptcha, email).\n- Frontend: jQuery and Bootstrap with real-time updates and Chart.js visuals.\n- Database: MySQL with normalized tables and indexes for fast vote tallying.\n- Deployment: Hosted on HostGator with Google ReCAPTCHA for extra security.\n\nDeveloping this system deepened my expertise in several key areas. I honed my ability to optimize high-traffic database queries, achieving a 30% reduction in response times through efficient indexing and query refactoring. Additionally, I mastered secure API integration particularly with third-party services like GCash by leveraging thorough documentation to ensure robust, maintainable code. This project also led me to adopt unit testing for critical components like vote calculations, enhancing reliability and enabling early detection of edge cases.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/online-voting-system.webp",
      "githubUrl": "https://github.com/javecilla/Online-Voting-System",
      "demoUrl": "https://voting.goldenmindsbulacan.com/",
      "technologies": [
        {
          "name": "MySQL",
          "icon": "mysqlIcon"
        },
        {
          "name": "Laravel",
          "icon": "laravelIcon"
        },
        {
          "name": "Bootstrap",
          "icon": "bootstrapIcon"
        },
        {
          "name": "jQuery",
          "icon": "jqueryIcon"
        },
        {
          "name": "JavaScript",
          "icon": "jsIcon"
        }
      ],
      "category": "Client",
      "isHighlight": true,
      "isRecent": false,
      "isAvailable": true,
      "link": "/project/online-voting-system"
    },
    {
      "id": 10,
      "title": "Kalat Mo, Yaman Ko",
      "description": "I developed Kalat Mo, Yaman Ko, a community-driven digital platform designed to transform clutter into opportunities and strengthen local connections through sustainability.\n\nThis platform empowers users to share, give away, and repurpose pre-loved items, aligning with the core principles of Reduce, Reuse, and Recycle. Beyond just item sharing, it’s a space built to promote eco-conscious living and foster a collaborative community ecosystem.\n\nI was referred by my professor to join the project team as the Frontend Developer, where I handled the full front-end implementation—ensuring a clean, responsive, and accessible user interface. The platform also integrates an automated CI/CD pipeline for frictionless deployment and iteration.\n\nKey Features\n\nCommunity-Centered Experience\n- Item Sharing & Repurposing – Users can give away or claim pre-loved items.\n- Eco-Sustainability Focus – Encourages reducing waste through community engagement.\n- Intuitive Navigation – Simple, guided flow for ease of use.\n\nFrontend Development Excellence\n- Responsive Web Design – Optimized for both desktop and mobile experiences.\n- Lightweight & Fast UI – Prioritizing performance and accessibility.\n- Clean Visual Hierarchy – Organized content that aligns with sustainability goals.\n\nCI/CD & Automation\n- GitHub Auto-Deployment – Every push to the main branch triggers live updates.\n- Continuous Integration – Smooth release cycles for fast iteration.\n- Scalable Codebase – Structured for future feature rollouts.\n\nThis project reflects a fusion of sustainable innovation and clean frontend engineering—a platform built to inspire communities to turn clutter into collective value.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/kalat-mo-yaman-ko.webp",
      "githubUrl": "https://github.com/javecilla/Kalat-Mo-Yaman-Ko",
      "demoUrl": "https://website-079a545a.fee.xnf.temporary.site/",
      "technologies": [
        {
          "name": "HTML",
          "icon": "htmlIcon"
        },
        {
          "name": "CSS",
          "icon": "cssIcon"
        },
        {
          "name": "Bootstrap",
          "icon": "bootstrapIcon"
        },
        {
          "name": "JavaScript",
          "icon": "jsIcon"
        }
      ],
      "category": "Client",
      "isHighlight": false,
      "isRecent": true,
      "isAvailable": true,
      "link": "/project/kalat-mo-yaman-ko"
    },
    {
      "id": 4,
      "title": "Ph-En Vocabulary Web App",
      "description": "I developed the Philippine-English Vocabulary Web App as a commissioned project for fourth-year Bachelor of Secondary Education (BSED) students majoring in English at Polytechnic University of the Philippines (PUP). Designed to enhance vocabulary mastery, this web app offers interactive learning tools, pronunciation guides, and quizzes to support effective language acquisition.\n\nKey Features\n- Extensive Word Collection: Covers Philippine English words with clear meanings.\n- Pronunciation Guide: Includes audio support to ensure correct pronunciation.\n- Contextual Usage: Sample sentences demonstrate real-world application.\n- Visual Aids: Pictures enhance memory retention.\n- Interactive Quizzes: Users can test their knowledge and track progress.\n- User Customization: Personalized settings for an adaptive learning experience.\n\nProject Timeline\n- August 2024 - Development & Launch: Initiated after discussions with PUP students and built to meet their academic needs.\n\nTechnical Challenges & Solutions\n- Audio Integration: Implemented a seamless audio playback feature for pronunciation guides.\n- Optimized Database Queries: Ensured fast retrieval of vocabulary data through efficient indexing.\n\nImpact\n- Improved vocabulary retention for students using structured learning modules.\n- Provided an accessible and engaging tool for self-paced learning.\n\nArchitecture\n- Backend: PHP for API development and content management.\n- Frontend: JavaScript with Bootstrap for a responsive UI.\n- Database: MySQL with optimized queries for efficient word lookup.\n- Deployment: Hosted on Hostinger for reliability and scalability.\n\nThis project reinforced my expertise in full-stack web development, particularly in integrating multimedia elements and optimizing database performance. The challenge of making vocabulary learning interactive pushed me to refine user experience design and create a tool that balances education with engagement.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/ph-en-vocabulary-web-app.webp",
      "githubUrl": "https://github.com/javecilla/Philippine_English_Vocabulary",
      "demoUrl": "https://philippineenglishvocabulary.com/",
      "technologies": [
        {
          "name": "MySQL",
          "icon": "mysqlIcon"
        },
        {
          "name": "PHP",
          "icon": "phpIcon"
        },
        {
          "name": "Bootstrap",
          "icon": "bootstrapIcon"
        },
        {
          "name": "jQuery",
          "icon": "jqueryIcon"
        },
        {
          "name": "JavaScript",
          "icon": "jsIcon"
        }
      ],
      "category": "Client",
      "isHighlight": false,
      "isRecent": false,
      "isAvailable": true,
      "link": "/project/ph-en-vocabulary-web-app"
    },
    {
      "id": 2,
      "title": "Golden Minds Official Website",
      "description": "I developed the Official Website for Golden Minds Colleges and Academy as a solo project, creating a dynamic platform to serve the student community. Launched to streamline access to essential information, updates, and academic resources, this site enhances the overall educational experience for students and staff.\n\nProblem & Solution\nGolden Minds Colleges lacked a centralized, user-friendly online presence, leaving students and staff reliant on scattered communication channels. I built a responsive, feature rich website that consolidates key resources course details, announcements, and contact information into one accessible hub, improving engagement and efficiency.\n\nKey Features\n- Dynamic Content: Real-time updates for announcements and events using Vue.js reactivity.\n- Responsive Design: Mobile-friendly interface built with Bootstrap for seamless access across devices.\n- Resource Hub: Centralized access to academic materials and institutional info.\n- Admin Dashboard: Tools for staff to manage content and track site usage.\n- SEO Optimization: Improved visibility on search engines for broader reach.\n\nProject Timeline\n- 2020 - Initial Launch: Debuted the site with core features for student access built using HTML, CSS and JavaScript developed by the school with a domain goldenmindsbulacan.com\n- 2022 - Major Upgrade: Migrated to Laravel and Vue.js for enhanced performance and maintainability with the new goldenminds.edu.ph domain.\n- 2023 - Feature Expansion: Added admin dashboard and resource hub based on feedback.\n- 2024 - Performance Upgrade: Optimized load times and SEO for better user experience.\n\nTechnical Challenges & Solutions\n- Frontend Reactivity: Integrated Vue.js with Laravel to enable dynamic updates without full page reloads, enhancing user interaction.\n- Database Scalability: Designed MySQL schemas with efficient indexing to handle growing content and user traffic.\n\nImpact\n- Reduced student inquiries by 35% by centralizing information online.\n- Achieved 6,000+ page views within six months of launch.\n- Praised by college administration for improving communication and accessibility.\n\nArchitecture\n- Backend: Laravel for robust API endpoints, content management, and authentication.\n- Frontend: Vue.js for reactive components paired with Bootstrap for styling.\n- Database: MySQL with normalized tables for scalable data storage.\n- Deployment: Hosted on HostGator with Google ReCaptcha for extra security.\n\nBuilding this website sharpened my skills in full-stack development. I gained proficiency in integrating Vue.js with Laravel for a smooth, reactive frontend, reducing average page load times by 25% through optimization techniques like lazy loading. I also improved my database design skills with MySQL, ensuring scalability for future growth, and embraced version control best practices using Git for efficient solo project management.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/golden-minds-official-website.webp",
      "githubUrl": "https://github.com/javecilla/Golden-Minds-Colleges-Web-System",
      "demoUrl": "https://www.goldenminds.edu.ph/",
      "technologies": [
        {
          "name": "MySQL",
          "icon": "mysqlIcon"
        },
        {
          "name": "Laravel",
          "icon": "laravelIcon"
        },
        {
          "name": "Bootstrap",
          "icon": "bootstrapIcon"
        },
        {
          "name": "Vue.js",
          "icon": "vueIcon"
        },
        {
          "name": "JavaScript",
          "icon": "jsIcon"
        }
      ],
      "category": "Client",
      "isHighlight": true,
      "isRecent": false,
      "isAvailable": true,
      "link": "/project/golden-minds-official-website"
    },
    {
      "id": 7,
      "title": "Online Account Receivables for Multi-Purpose Cooperative",
      "description": "An individual project Online Account Receivables (OAR) System for a Multi-Purpose Cooperative during my 2nd Year on Web System Technologies subject. This system streamlines the management of cooperative accounts, transactions, and financial records, enhancing efficiency and transparency.\n\nKey Features\n- User-Friendly Interface: Intuitive design for easy navigation.\n- User Management:\n  - Admin Panel:\n    - Add, update, and remove members.\n    - Assign roles (Administrator, Member, Accountant).\n    - Reset passwords and manage user credentials.\n  - Member Access:\n    - View their account balances, invoices, and payment history\n    - Submit proof of payment.\n- Accounts Receivable Management\n  - Invoice Management:\n    - Generate and send invoices to members.\n    - Automate recurring invoices for periodic contributions or loans.\n    - Track overdue invoices.\n  - Payment Tracking:\n    - Record payments made by members (manual and auto-reconciled via bank integration).\n    - Monitor payment statuses (paid, pending, overdue).\n    - Send payment reminders and notifications via email.\n- Financial Reporting\n  - Generate reports for:\n    - Outstanding receivables by member and total.\n    - Payment histories and trends.\n    - Monthly, quarterly, and annual financial summaries.\n- Notifications and Alerts\n  - Notify members of:\n    - Upcoming payment deadlines.\n    - Overdue accounts.\n  - Alert administrators about overdue accounts, unusual activity, or system errors.\n- Data Security and Backup\n  - Role-based access control (RBAC) to restrict access.\n  - Encrypt sensitive data (e.g., payment details).\n  - Implement daily automated backups of the database.\n- Additional Security\n  - Implement CAPTCHA for form submissions to prevent automated submissions.\n  - Implement two-factor authentication for account access.\n  - Implement a password reset mechanism for lost passwords.\n\nDevelopment Journey\nA solo or individual project given by my professor, I developed this system to meet the requirements of the Web System Technologies subject.\n\nTechnical Stack\n- Backend: PHP for API development and server-side logic.\n- Frontend: JavaScript and CSS for a responsive and interactive UI.\n- Database: MySQL for structured data storage and efficient retrieval.\n- Deployment: Hosted on a Infinity.\n\nThis project refined my skills in full-stack development, particularly in designing efficient database structures and implementing role-based access control.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/online-account-receivables-for-multi-purpose-cooperative.webp",
      "githubUrl": "https://github.com/javecilla/it211-project-account-receivable",
      "demoUrl": "https://avecilla-project-multipurpose.infinityfreeapp.com",
      "technologies": [
        {
          "name": "MySQL",
          "icon": "mysqlIcon"
        },
        {
          "name": "PHP",
          "icon": "phpIcon"
        },
        {
          "name": "Bootstrap",
          "icon": "bootstrapIcon"
        },
        {
          "name": "jQuery",
          "icon": "jqueryIcon"
        },
        {
          "name": "JavaScript",
          "icon": "jsIcon"
        }
      ],
      "category": "Academic",
      "isHighlight": false,
      "isRecent": false,
      "isAvailable": true,
      "link": "/project/online-account-receivables-for-multi-purpose-cooperative"
    },
    {
      "id": 11,
      "title": "Clinic Information System for Dr. Pau Animal Bite Center",
      "description": "This project CIS for Dr. Pau Animal Bite Center is a web application developed to accomplish the requirements of the IT 305W - Advance Web Application a group project and i am team leader and developer of the project.\n\nAbout the Project\nThe Clinic Information System is designed to solve a common problem for medical clinics: the inefficient and decentralized management of patient records and appointments. This initial version focuses on the core Patient Management Module, which allows patients to register, log in, and book their own appointments online, while also empowering clinic staff to manage walk-in patients and view the daily appointment schedule.\n\nThe application utilizes the Create, Read, Update & Delete (CRUD) method for all data operations, with all information securely stored and managed using Firebase services as required by the project specifications.\n\nKey Features\n\nPatient Portal\n- Secure Authentication – User registration with email verification and login using Firebase Authentication.\n- Personal Dashboard – View profile information and appointment history.\n- Appointment Booking – A multi-step form to book new appointments for either a New Bite Incident or a Follow-up/General Consultation.\n\nStaff Portal\n- Daily Appointments – A comprehensive dashboard displaying the list of patient appointments for the day.\n- Patient Search – Functionality to search for existing patients.\n- Walk-in Registration – A dedicated form for staff to register walk-in patients directly.\n\nTechnologies Used\nThis project is built using modern web technologies to ensure a responsive, efficient, and scalable application.\n\n- Front-End Framework: ReactJS (with Functional Components and Hooks)\n- Styling: Bootstrap\n- Icons: Font Awesome\n- Backend as a Service (BaaS): Firebase\n- Authentication: Firebase Authentication for user registration and login.\n- Database: Firebase Realtime Database to store and manage all application data.\n- Storage: Firebase Storage for user profile pictures.\n- Hosting: Firebase Hosting for final deployment.\n- Google ReCAPTCHA: reCAPTCHA v2 (Checkbox) for client-side anti-bot verification on sensitive forms.\n- Email Service: EmailJS for sending email notifications.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/clinic-information-system-for-dr-pau-animal-bite-center.webp",
      "githubUrl": "https://github.com/javecilla/CIS-AWA-BSIT3EG1-PROJECT",
      "demoUrl": "https://cis-awa-bsit3eg1-project.web.app/",
      "technologies": [
        {
          "name": "HTML",
          "icon": "htmlIcon"
        },
        {
          "name": "Bootstrap",
          "icon": "bootstrapIcon"
        },
        {
          "name": "React",
          "icon": "reactIcon"
        },
        {
          "name": "Firebase",
          "icon": "firebaseIcon"
        }
      ],
      "category": "Academic",
      "isHighlight": false,
      "isRecent": true,
      "isAvailable": true,
      "link": "/project/clinic-information-system-for-dr-pau-animal-bite-center"
    },

    {
      "id": 8,
      "title": "Golden Minds Revised SIMSSHS",
      "description": "I developed the Golden Minds Colleges Student Information Management System (SIMS) for Senior High School as a solo project to streamline academic operations and improve data accuracy. This platform empowers the institution with modern tools for managing student records, grades, enrollment, and scheduling.\n\nProblem & Solution\nThe existing portal at Golden Minds Colleges was built entirely with legacy PHP code, making it difficult to maintain, scale, or extend with new features. It lacked modern architecture, resulting in frequent bugs and limited flexibility for academic operations. To address this, I redeveloped the system from the ground up using Laravel and Vue.js—creating a centralized, secure, and modular platform that supports efficient student data management, easier maintenance, and future enhancements.\n\nKey Features\n- Student Records Management: Store and manage student profiles, enrollment data, and academic history.\n- Grading System: Enable instructors to encode and release grades digitally with controlled access.\n- Class Scheduling: Build and manage class schedules with conflict detection and printable reports.\n- Admin Dashboard: User role-based access for managing system-wide data and activity logs.\n- Responsive Interface: Vue.js and Bootstrap for seamless usability across desktops and mobile devices.\n\nProject Timeline\n- 2020 – Initial Launch: The original portal was developed internally by the school using raw HTML, CSS, JavaScript, and PHP. While functional, it lacked scalability, structure, and modern development standards.\n- 2022 – Planning & Proposal: I initiated a proposal to rebuild the system using a modern tech stack (Laravel + Vue.js), aiming to improve maintainability, security, and user experience.\n- 2023 – System Rebuild & Expansion: I rebuilt the platform from scratch, introducing core features such as class scheduling, user role-based access, and a more modular design. Submitted for administrative review and feedback.\n- 2024 – Approval & Ongoing Development: The revised system received approval from the administration. Continuous development is underway, focusing on stability, new features, and long-term maintainability.\n\nImpact\n- Reduced administrative processing time by 40% across admissions and grading workflows.\n- Increased transparency for students with 24/7 access to personal records.\n- Improved staff efficiency by consolidating core academic operations into one platform.\n\nArchitecture\n- Backend: Laravel for API development, role-based authentication, and server-side validation.\n- Frontend: Vue.js components integrated with Tailwind for responsive UI/UX.\n- Database: PostgreSQL with optimized schema designs for reliable and scalable data management.\n- Containerization: Docker for consistent development environments and simplified deployment workflows.\n- Deployment: Deployed on HostGator with Cloudflare support for enhanced performance and security.\n\nThis project deepened my experience in building modular and scalable systems for educational institutions. I sharpened my expertise in backend architecture with Laravel, frontend reactivity with Vue.js, and secure data modeling with PostgreSQL. I also applied version control best practices to maintain consistent progress throughout the solo development cycle.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/golden-minds-revised-simsshs.webp",
      "githubUrl": "https://github.com/javecilla/GMC-SIMSSHS-Revised",
      "demoUrl": "https://simsshs.goldenminds.edu.ph/",
      "technologies": [
        {
          "name": "PostgreSQL",
          "icon": "postgresIcon"
        },
        {
          "name": "Laravel",
          "icon": "laravelIcon"
        },
        {
          "name": "Tailwind CSS",
          "icon": "tailwindIcon"
        },
        {
          "name": "Vue.js",
          "icon": "vueIcon"
        },
        {
          "name": "TypeScript",
          "icon": "tsIcon"
        },
        {
          "name": "Docker",
          "icon": "dockerIcon"
        }
      ],
      "category": "Client",
      "isHighlight": true,
      "isRecent": false,
      "isAvailable": true,
      "link": "/project/golden-minds-revised-simsshs"
    },
    {
      "id": 5,
      "title": "Web-Based Inventory System",
      "description": "I developed the Web-Based Inventory System as a thesis project during my Senior High School at Golden Minds Colleges, Sta. Maria Campus, Bulacan. This project fulfills the requirements of the Information and Communication Technology (ICT) strand and provides a structured and automated approach to managing HRM tools and equipment inventories.\n\nKey Features\n- User-Friendly Interface: Intuitive design for easy navigation.\n- Real-Time Tracking: Monitors the location and status of tools and equipment.\n- Transaction Management: Handles borrowing, returning, and inventory updates.\n- Dynamic Report Generation: Provides essential reports for data-driven decisions.\n- Automated Alerts: Notifies users of low stock, damaged equipment, or critical updates.\n- Integrated Mailing System: Sends email notifications for important actions.\n\nDevelopment Journey\nDuring Grade 12, I led my group in developing this system, focusing on innovation and usability. Our dedication and technical approach earned us the Best Thesis for Innovation award. The system has since been officially adopted by Golden Minds Colleges as their primary inventory management tool.\n\nTechnical Stack\n- Backend: PHP for API development and server-side logic.\n- Frontend: JavaScript and CSS for a responsive and interactive UI.\n- Database: MySQL for structured data storage and efficient retrieval.\n- Deployment: Hosted on a HostGator.\n\nThis project refined my skills in full-stack development, particularly in designing efficient database structures and implementing real-time tracking systems.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/web-based-inventory-system.png",
      "githubUrl": "https://github.com/javecilla/Web-Based-Inventory-Management-System",
      "demoUrl": "https://ims.goldenmindsbulacan.com/",
      "technologies": [
        {
          "name": "MySQL",
          "icon": "mysqlIcon"
        },
        {
          "name": "PHP",
          "icon": "phpIcon"
        },
        {
          "name": "Bootstrap",
          "icon": "bootstrapIcon"
        },
        {
          "name": "jQuery",
          "icon": "jqueryIcon"
        },
        {
          "name": "JavaScript",
          "icon": "jsIcon"
        }
      ],
      "category": "Academic",
      "isHighlight": false,
      "isRecent": false,
      "isAvailable": true,
      "link": "/project/web-based-inventory-system"
    },
    {
      "id": 6,
      "title": "Conversational Chatbot (FAQs)",
      "description": "A personalized conversational chat bot that answer all FAQs about me, integrating generative AI to provide real-time, interactive responses, natural langauge that similar to the AI chat platforms like ChatGPT, Claude, etc.\n\nKey Features\n\nUser-Friendly Interface\n- Collapsible Chat Box - like the messenger interface.\n- Option to End Chat & Start a New Conversation\n- Typing Indicator – Show a \"bot is typing...\" animation for a more natural feel.\n- Quick Reply Buttons – Provide suggested questions that users can tap instead of typing.\n- Starter Categorization Conversation - Show a \"starter conversation for a more natural like \"Hello i am Javecilla ChatBot, How can i assist you?\" and then show suggestions questions like \"Who are you?\", \"What’s your background? and \"What services do you offer?\",\n\nImproved Chat Experience\n- Chunked AI Responses for Real-Time Feel - Show AI responses in chunks for a more natural flow.\n- Autoscroll to Latest Message – Ensure new messages are always visible.\n- Message Timestamp – Show timestamps for each user and bot message.\n- Emoji & Markdown Support – Improve readability and engagement with emojis or formatting (bold, italics, etc.).\n\nPersistent & Session-Based Features\n- Store Chat (state-pinia) History for Current Session\n- Load Previous Chats on Page Reload – Restore chat history when the user revisits.\n- Database Option (Google Firebase) – Store chat history beyond the current session for returning users.\n\nSmart Features & Enhancements\n- Smart Search for FAQs – Let users type keywords, and the chatbot suggests related FAQs.\n- Fallback Handling – If the bot doesn't know an answer, it can guide the user to contact you or check your website.\n- FAQ Categorization – Organize FAQs into categories (e.g., Services, Pricing, Contact).\n\nAccessibility\n- Screen Reader Support – Ensure content is readable by screen readers.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/conversational-chatbot-for-faqs.png",
      "githubUrl": "https://github.com/javecilla/Conversational-Chatbot-for-FAQs",
      "demoUrl": "https://chatbot-faqs.vercel.app/",
      "technologies": [
        {
          "name": "Vue.js",
          "icon": "vueIcon"
        },
        {
          "name": "TypeScript",
          "icon": "tsIcon"
        },
        {
          "name": "Tailwind CSS",
          "icon": "tailwindIcon"
        },
        {
          "name": "Firebase",
          "icon": "firebaseIcon"
        }
      ],
      "category": "Personal",
      "isHighlight": false,
      "isRecent": false,
      "isAvailable": false,
      "link": "/project/conversational-chatbot-for-faqs"
    },

    {
      "id": 9,
      "title": "Gallery Website",
      "description": "Welcome to our little corner of the internet—a digital gallery that showcases moments, memories, and creations that mean the world to us.\n\nThis website features visual content like images and videos, thoughtfully arranged to reflect both artistry and emotion. More than just a gallery, it’s a shared space—a canvas that holds pieces of our story.\n\nIt’s filled with content inspired by me and my girlfriend—from the meaningful to the mundane—and serves as our personal archive of love, laughter, and the beautiful chaos we’ve captured together.\n\nKey Features\n\nAesthetic Visual Gallery\n- Image and Video Display – Organized into albums and categories.\n- Full-Screen Viewing – Immersive mode to enjoy every photo in detail.\n- Mobile Responsive Design – Seamlessly adapts across devices for consistent experience.\n\nPersonal Touch\n- Custom Titles and Captions – Each memory comes with a personal note or label.\n- Themed Collections – Albums grouped by places, seasons, or shared experiences.\n- Editorial-Style Descriptions – Each section tells a short story or emotion behind the moment.\n\nUser Interaction Features\n- Soft Animations – Subtle transitions to enhance viewing experience.\n- Auto Scroll to Latest – Keeps the latest uploads in focus.\n- Pin Favorite Memories – Highlighted posts to revisit again and again.\n\nTechnical Stack\n- Vue.js + TypeScript – For smooth, component-driven interactivity.\n- Tailwind CSS – Clean, responsive, and minimalistic design styling.\n- Firebase – For storage, hosting, and real-time data sync.\n\nThis project isn’t just a site—it’s a space to relive the memories that shaped us. A love letter written in pixels and frames.",
      "image": "https://website-376b6968.fee.xnf.temporary.site/assets/projects/gallery-website.png",
      "githubUrl": "https://github.com/javecilla/04-12-2024",
      "demoUrl": "https://04122024.vercel.app/",
      "technologies": [
        {
          "name": "Vue.js",
          "icon": "vueIcon"
        },
        {
          "name": "TypeScript",
          "icon": "tsIcon"
        },
        {
          "name": "Tailwind CSS",
          "icon": "tailwindIcon"
        },
        {
          "name": "Firebase",
          "icon": "firebaseIcon"
        }
      ],
      "category": "Personal",
      "isHighlight": false,
      "isRecent": false,
      "isAvailable": true,
      "link": "/project/gallery-website"
    }
  ]
}
